## KEERTHANA S
### DS205229119

### Lab3. Pandas Indexing and Selection

In [1]:
import pandas as pd

df1 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],
                    "IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])

df2 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],
                    "IND_GDP":[50,45,45,67]}, index=[2005, 2006,2007,2008])

In [98]:
df1

      HPI  Int_Rate  IND_GDP
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67

In [99]:
df2

      HPI  Int_Rate  IND_GDP
2005   80         2       50
2006   90         1       45
2007   70         2       45
2008   60         3       67

In [100]:
df = pd.concat([df1,df2])

### ConcatenationÂ of two frames

In [101]:
df

      HPI  Int_Rate  IND_GDP
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67
2005   80         2       50
2006   90         1       45
2007   70         2       45
2008   60         3       67

### Slicing the Data Frame

In [108]:
df.iloc[0:2]

      HPI  Int_Rate  IND_GDP
2001   80         2       50
2002   90         1       45

In [110]:
df.iloc[6:8]

      HPI  Int_Rate  IND_GDP
2007   70         2       45
2008   60         3       67

In [112]:
df1 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],
                    "IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])

df2 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],
                    "IND_GDP":[50,45,45,67]}, index=[2005, 2006,2007,2008])

df = pd.concat([df1, df2])
df

      HPI  Int_Rate  IND_GDP
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67
2005   80         2       50
2006   90         1       45
2007   70         2       45
2008   60         3       67

### Change the index

In [118]:
df = pd.DataFrame({"Day":[1,2,3,4], "Visitors":[200,100,230,300], "Bounce_Rate":[20,45,60,10]})
def switch_columns(df, col1=None, col2=None):
    colnames = df.columns.tolist()
    i1, i2 = colnames.index(col1), colnames.index(col2)
    colnames[i2], colnames[i1] = colnames[i1], colnames[i2]
    return df[colnames]
df1 = switch_columns(df, 'Bounce_Rate', 'Visitors')
print(df1.to_string(index=False))

 Day  Bounce_Rate  Visitors
   1           20       200
   2           45       100
   3           60       230
   4           10       300

In [61]:
df = pd.DataFrame({"Day":[1,2,3,4], "Bounce_Rate":[20,45,60,10], "Visitors":[200,100,230,300],})
print(df.to_string(index=False))

 Day  Bounce_Rate  Visitors
   1           20       200
   2           45       100
   3           60       230
   4           10       300

### Change the Column Headers from âVisitorsâ to âUsersâ

In [62]:
df = pd.DataFrame({"Day":[1,2,3,4], "Visitors":[200,100,230,300],"Bounce_Rate":[20,45,60,10],})
df = df.set_axis(["Day", "Users", "Bounce_Rate"], axis=1)
df

   Day  Users  Bounce_Rate
0    1    200           20
1    2    100           45
2    3    230           60
3    4    300           10

### A data frame is made from the csv file and the data frame is sorted in ascending order of Names of Players.

In [93]:
df = pd.read_csv("nba.csv")
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [94]:
df.sort_values(by='Name',ascending=True)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
152,Aaron Brooks,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
356,Aaron Gordon,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0
328,Aaron Harrison,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0
404,Adreian Payne,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
...,...,...,...,...,...,...,...,...,...
270,Xavier Munford,Memphis Grizzlies,14.0,PG,24.0,6-3,180.0,Rhode Island,NaN
402,Zach LaVine,Minnesota Timberwolves,8.0,PG,21.0,6-5,189.0,UCLA,2148360.0
271,Zach Randolph,Memphis Grizzlies,50.0,PF,34.0,6-9,260.0,Michigan State,9638555.0
237,Zaza Pachulia,Dallas Mavericks,27.0,C,32.0,6-11,275.0,NaN,5200000.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Find the positions of numbers that are multiples of 3 fromÂ ser.

In [64]:
ser = pd.Series(np.random.randint(1, 10, 7))
ser

0    1
1    6
2    1
3    2
4    6
5    8
6    4
dtype: int32

In [65]:
print(ser)
np.where(ser % 3==0)

0    1
1    6
2    1
3    2
4    6
5    8
6    4
dtype: int32

(array([1, 4], dtype=int64),)

### How to extract items at given positions from a series?

In [66]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

### How to convert the first character of each element in a series to uppercase?

In [67]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
pd.Series([i.title() for i in ser])

0     How
1      To
2    Kick
3    Ass?
dtype: object

### How to compute difference of differences between consecutive numbers of a series?

In [68]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

print(ser.diff().tolist())
print(ser.diff().diff().tolist())

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

### How to get the day of month, week number, day of year and day of week from a series of date strings?

In [79]:
import warnings

warnings.filterwarnings('ignore')

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

from dateutil.parser import parse
ser_ts = ser.map(lambda x: parse(x))

print("Date: ", ser_ts.dt.day.tolist())

print("Week number: ", ser_ts.dt.weekofyear.tolist())

print("Day number of year: ", ser_ts.dt.dayofyear.tolist())

print("Day of week: ", ser_ts.dt.day_name())

Date:  [1, 2, 3, 4, 5, 6]
Week number:  [53, 5, 9, 14, 19, 23]
Day number of year:  [1, 33, 63, 94, 125, 157]
Day of week:  0       Friday
1    Wednesday
2     Saturday
3     Thursday
4       Monday
5     Saturday
dtype: object

### How to filter words that contain at least 2 vowels from a series?

In [70]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

### How to filter valid emails from a series?

In [71]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])

import re
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
mask = emails.map(lambda x: bool(re.match(pattern, x)))
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

### How to find all the local maxima (or peaks) in a numeric series? Get the positions of peaks (values surrounded by smaller values on both sides) in ser.

In [72]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

dd = np.diff(np.sign(np.diff(ser)))
peak_locs = np.where(dd == -2)[0] + 1
peak_locs

array([1, 5, 7], dtype=int64)

### How to change the order of columns of a dataframe?

In [73]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

### a

In [74]:
df[list('cbade')]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

### b

In [75]:
def switch_columns(df, col1=None, col2=None):
    colnames = df.columns.tolist()
    i1, i2 = colnames.index(col1), colnames.index(col2)
    colnames[i2], colnames[i1] = colnames[i1], colnames[i2]
    return df[colnames]
df1 = switch_columns(df, 'a', 'c')
df1

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

### c

In [76]:
df.sort_index(axis=1, ascending=False, inplace=True)
df

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

### How to create a new column that contains the row number of nearest column by euclidean distance?

In [77]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))

nearest_rows = []
nearest_distance = []

for i, row in df.iterrows():
    curr = row
    rest = df.drop(i)
    e_dists = {}  
    for j, contestant in rest.iterrows():
        e_dists.update({j: round(np.linalg.norm(curr.values - contestant.values))})
    nearest_rows.append(max(e_dists, key=e_dists.get))
    nearest_distance.append(max(e_dists.values()))

df['nearest_row'] = nearest_rows
df['dist'] = nearest_distance

In [78]:
df

    p   q   r   s nearest_row   dist
a  81  90  59  47           f   93.0
b  52  65  95  47           e   94.0
c  51  24  58  88           i  108.0
d  97  16  86  51           f  115.0
e  79  85  11  20           d  108.0
f   3  63  71   6           d  115.0
g  71  57  43  16           c   83.0
h  68  86  85  43           j   94.0
i  98  85  71  14           j  117.0
j  11  42  29  64           i  117.0